#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.[0m

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # digitalocean_vpc.homelab must be replaced
-/+ resource "digitalocean_vpc" "homelab" {
      ~ created_at = "2025-01-05 16:13:33 +0000 UTC" -> (known after apply)
      ~ default    = true -> (known after apply)
      ~ id         = "fce3e29f-bc4d-4edd-b19e-1780919c67c9" -> (known after apply)
      ~ ip_range   = "10.10.100.0/23" -> "10.10.100.0/22" # forces replacement
        name       = "homelab-network"
      ~ urn        = "do:vpc:fce3e29f-bc4d-4edd-b19e-1780919c67c9" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @TheOpsDev, Action: `pull_request`, Working Directory: `opentofu/digitalocean`, Workflow: `OpenTofu Comment PR`*